<?php

namespace NumberToWords\Language\Bulgarian;

use NumberToWords\Language\Dictionary;

class BulgarianDictionary implements Dictionary
{
    public const LOCALE = 'bg_BG';
    public const LANGUAGE_NAME = 'Bulgarian';
    public const LANGUAGE_NAME_NATIVE = 'български';

    protected string $zero = "нула";
    protected string $minus = "минус";
    /** Token to separate words in triplets and chunks in final string */
    protected string $separator = " ";

    protected static array $units = ['един', 'два', 'три', 'четири', 'пет', 'шест', 'седем', 'осем', 'девет'];
    protected static array $unitsFemale = [
        'една',
        'две',
        'три',
        'четири',
        'пет',
        'шест',
        'седем',
        'осем',
        'девет',
    ];

    protected static array $teens = [
        'десет',
        'единадесет',
        'дванадесет',
        'тринадесет',
        'четиринадесет',
        'петнадесет',
        'шестнадесет',
        'седемнадесет',
        'осемнадесет',
        'деветнадесет'
    ];

    protected static array $tens = [
        '',
        'десет',
        'двадесет',
        'тридесет',
        'четиридесет',
        'петдесет',
        'шестдесет',
        'седемдесет',
        'осемдесет',
        'деветдесет'
    ];

    private static array $hundreds = [
        0 => '',
        1 => 'сто',
        2 => 'двеста',
        3 => 'триста',
        4 => 'четиристотин',
        5 => 'петстотин',
        6 => 'шестстотин',
        7 => 'седемстотин',
        8 => 'осемстотин',
        9 => 'деветстотин'
    ];

    public static string $and = 'и';
    public static array $currencyNames = [
        'ALL' => [['лек', 'лека'], ['киндарка', 'киндарки']],
        'AED' => [['дирхам на ОАЕ', 'дирхама на ОАЕ'], ['филс', 'филса']],
        'AUD' => [['австралийски долар', 'австралийски долара'], ['цент', 'цента']],
        'BAM' => [['конвертируема марка', 'конвертируеми марки'], ['фениг', 'фенига']],
        'BGN' => [['лев', 'лева'], ['стотинка', 'стотинки']],
        'BRL' => [['реал', 'реала'], ['сентаво', 'сентави']],
        'BYR' => [['беларуска рубла', 'беларуски рубли'], ['копейки', 'копейки']],
        'CAD' => [['канадски долар', 'канадски долари'], ['цент', 'цента']],
        'CHF' => [['швейцарски франк', 'швейцарски франка'], ['сантим', 'сантима']],
        'CYP' => [['кипърска лира', 'кипърски лири'], ['цент', 'цента']],
        'CZK' => [['чешка крона', 'чешки крони'], ['халер', 'халера']],
        'DKK' => [['датска крона', 'датски крони'], ['йоре', 'йоре']],
        'DZD' => [['алжирски динар', 'алжирски динара'], ['цент', 'цента']],
        'EEK' => [['естонска крона', 'естонски крони'], ['цент', 'цента']],
        'EGP' => [['египетска лира'], ['пиастър', 'пиастъра']],
        'EUR' => [['евро', 'евро'], ['цент', 'цента']],
        'GBP' => [['британска лира', 'британски лири'], ['пенс', 'пенса']],
        'HKD' => [['хонгконгски долар', 'хонгконгски долара'], ['цент', 'цента']],
        'HRK' => [['хърватска куна', 'хърватски куни'], ['лип', 'липа']],
        'HUF' => [['форинт', 'форинта'], ['филер', 'филера']],
        'ILS' => [['шекел', 'шекела'], ['агорот', 'агороти']],
        'ISK' => [['исландска крона', 'исландски крони'], ['ейре', 'ейре']],
        'JPY' => [['йена', 'йени'], ['сен', 'сена']],
        'LTL' => [['литас', 'литаса'], ['цент', 'цента']],
        'LVL' => [['лат', 'лата'], ['сантим', 'сантима']],
        'LYD' => [['либийски динар', 'либийски динара'], ['цент', 'цента']],
        'MAD' => [['марокански дирхам', 'марокански дирхама'], ['цент', 'цента']],
        'MKD' => [['македонски денар', 'македонски денара'], ['ден', 'дени']],
        'MRO' => [['угия', 'угии'], ['хумс', 'хумса']],
        'MTL' => [['малтийска лира', 'малтийски лири'], ['сантим', 'сантима']],
        'NGN' => [['найра', 'найра'], ['кобо', 'кобо']],
        'NOK' => [['норвежка крона', 'норвежки крони'], ['йоре', 'йоре']],
        'PHP' => [['филипинско песо', 'филипински песа'], ['сентаво', 'сентави']],
        'PLN' => [['злоти', 'злоти'], ['грош', 'гроша']],
        'ROL' => [['лея', 'леи'], ['бан', 'бани']],
        'RUB' => [['рубла', 'рубли'], ['копейка', 'копейки']],
        'SAR' => [['риал', 'риала'], ['халал', 'халала']],
        'SEK' => [['шведска крона', 'шведски крони'], ['йоре', 'йоре']],
        'SIT' => [['толар', 'толара'], ['стотина', 'стотини']],
        'SKK' => [['словашка крона', 'словашки крони'], ['халиер', 'халиера']],
        'TMT' => [['туркменски манат', 'туркменски маната'], ['тенге', 'тенги']],
        'TND' => [['унизийски динар', 'тунизийски динара'], ['милим', 'милима']],
        'TRL' => [['турска лира', 'турски лири'], ['куруш', 'куруша']],
        'TRY' => [['турска лира', 'турски лири'], ['куруш', 'куруша']],
        'UAH' => [['гривна', 'гривни'], ['копийка', 'копийки']],
        'USD' => [['долар', 'долара'], ['цент', 'цента']],
        'XAF' => [['CFA франк', 'CFA франка'], ['цент', 'цента']],
        'XOF' => [['CFA франк', 'CFA франка'], ['цент', 'цента']],
        'XPF' => [['CFP франк', 'CFP франка'], ['сантим', 'сантима']],
        'YUM' => [['югославски динар', 'югославски динари'], ['пара', 'пари']],
        'ZAR' => [['ранд', 'ранда'], ['цент', 'цента']],
        'UZS' => [['сом', 'сома'], ['тийн', 'тийна']],
    ];

    public function getSeparator(): string
    {
        return $this->separator;
    }

    public function getZero(): string
    {
        return $this->zero;
    }

    public function getMinus(): string
    {
        return $this->minus;
    }

    public function getCorrespondingUnit(int $unit): string
    {
        return self::$units[$unit];
    }

    public function getCorrespondingUnitFemale(int $unit): string
    {
        return self::$unitsFemale[$unit];
    }

    public function getCorrespondingTen(int $ten): string
    {
        return self::$tens[$ten];
    }

    public function getCorrespondingTeen(int $teen): string
    {
        return self::$teens[$teen];
    }

    public function getCorrespondingHundred(int $hundred): string
    {
        return self::$hundreds[$hundred];
    }
}
