<?php
namespace Kwn\NumberToWords\Language\Russian\Dictionary;

use Kwn\NumberToWords\Grammar\Slavonic\Dictionary\Currency as SlavonicCurrency;

class Currency extends SlavonicCurrency
{
    protected $units = [
        'PLN' => ['злотый', 'злотых', 'злотых'],
        'EUR' => ['евро', 'евро', 'евро'],
        'GBP' => ['фунт', 'фунты', 'фунтов'],
        'USD' => ['доллар', 'доллары', 'долларов'],
        'CHF' => ['франк', 'франки', 'франков'],
        'RON' => ['лей', 'лее', 'леев'],
        'HUF' => ['форинт', 'форинты', 'форинтов'],
        'CZK' => ['крона', 'кроны', 'крон'],
        'DKK' => ['крона', 'кроны', 'крон'],
        'SEK' => ['крона', 'кроны', 'крон'],
        'UAH' => ['гривна', 'гривны', 'гривен'],
        'KZT' => ['тенге', 'тенге', 'тенге'],
        'RUB' => ['рубль', 'рубля', 'рублей'],
    ];

    protected $subunits = [
        'PLN' => ['пенни', 'пенни', 'пенни'],
        'EUR' => ['евро цент', 'евро цента', 'евро центов'],
        'GBP' => ['пенс', 'пенса', 'пенсов'],
        'USD' => ['цент', 'цента', 'центов'],
        'CHF' => ['сантим', 'сантима', 'сантимов'],
        'RON' => ['бан', 'баны', 'банов'],
        'HUF' => ['филлер', 'филлеры', 'филлеров'],
        'CZK' => ['геллер', 'геллери', 'геллеров'],
        'DKK' => ['оре', 'оре', 'оре'],
        'SEK' => ['оре', 'оре', 'оре'],
        'UAH' => ['копейка', 'копейки', 'копеек'],
        'KZT' => ['тиын', 'тиын', 'тиын'],
        'RUB' => ['копейка', 'копейки', 'копеек'],
    ];
}