<?php
namespace Kwn\NumberToWords\Language\Ukrainian\Dictionary;

use Kwn\NumberToWords\Grammar\Gender;

class Number
{
    static public $zero = 'нуль';

    static public $ten = [
        ['', 'один', 'два', 'три', 'чотири', 'п\'ять', 'шість', 'сім', 'вісім', 'дев\'ять'],
        ['', 'одна', 'дві', 'три', 'чотири', 'п\'ять', 'шість', 'сім', 'вісім', 'дев\'ять'],
    ];

    static public $teens = [
        'десять',
        'одинадцять',
        'дванадцять',
        'тринадцять',
        'чотирнадцять',
        'п\'ятнадцять',
        'шістнадцять',
        'сімнадцять',
        'вісімнадцять',
        'дев\'ятнадцять',
    ];

    static public $tens = [
        2 => 'двадцять',
        'тридцять',
        'сорок',
        'п\'ятдесят',
        'шістдесят',
        'сімдесят',
        'вісімдесят',
        'дев\'яносто',
    ];

    static public $hundred = [
        '',
        'сто',
        'двісті',
        'триста',
        'чотириста',
        'п\'ятсот',
        'шістсот',
        'сімсот',
        'вісімсот',
        'дев\'ятсот',
    ];

    static public $mega = [
        [3 => Gender::FEMALE],
        [3 => Gender::MALE],

        ['тисяча', 'тисячі', 'тисяч', Gender::FEMALE],
        ['мільйон', 'мільйони', 'мільйонів', Gender::MALE],
        ['мільярд', 'мільярди', 'мільярдів', Gender::MALE],
        ['трильйон', 'трильйони', 'трильйонів', Gender::MALE],
        ['квадрильйон', 'квадрильйони', 'квадрильйонів', Gender::MALE],
        ['секстильйон', 'секстильйони', 'секстильйонів', Gender::MALE],
    ];


    public function reverseTen() {
        self::$ten = array_reverse(self::$ten);
    }
}
